20-topics/emacs-org/basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-08 三 03:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs org Basics</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs org Basics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4800843">1. Org Mode 基础: 结构、设计原理</a>
<ul>
<li><a href="#orgd853307">1.1. 本节定位</a></li>
<li><a href="#org0a31b7b">1.2. 为什么会有 Org: 它解决什么问题</a></li>
<li><a href="#orgbd22973">1.3. Org 的设计原理: 纯文本 + 层次结构 + 结构操作</a>
<ul>
<li><a href="#org62a670d">1.3.1. 纯文本</a></li>
<li><a href="#org10740ed">1.3.2. 层级结构</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6bef478">2. 项目</a>
<ul>
<li><a href="#org651e46c">2.1. 子任务A</a>
<ul>
<li><a href="#orgd8d8a85">2.1.1. 细节1</a></li>
</ul>
</li>
<li><a href="#org74fb6bd">2.2. 子任务B</a>
<ul>
<li><a href="#org5006b9f">2.2.1. 结构操作</a></li>
</ul>
</li>
<li><a href="#org8fc207c">2.3. Org 在 Emacs 里如何工作的</a>
<ul>
<li><a href="#org2f2656b">2.3.1. Org 建立在 Outline Mode 上</a></li>
<li><a href="#orgf2b4af1">2.3.2. 折叠是核心交互</a></li>
<li><a href="#org95409b1">2.3.3. buffer里的“文本”与“结构”是同时存在的</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4800843" class="outline-2">
<h2 id="org4800843"><span class="section-number-2">1.</span> Org Mode 基础: 结构、设计原理</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd853307" class="outline-3">
<h3 id="orgd853307"><span class="section-number-3">1.1.</span> 本节定位</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Org不是一个排版语言，而是一种在Emacs里操作树状文本的方式。
</p>

<p>
官方文档在开头就强调，Org是建立在 Outline Mode 之上的；它是用纯文本保存内容，用折叠与结构编辑来管理大型文件。也就是说，Org 模式的核心是“可组织、可折叠、可继续加工”。
</p>

<hr />
</div>
</div>
<div id="outline-container-org0a31b7b" class="outline-3">
<h3 id="org0a31b7b"><span class="section-number-3">1.2.</span> 为什么会有 Org: 它解决什么问题</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Org 关心的是 “怎么长期维护笔记”。
</p>

<p>
当一个文件越来越长时，最麻烦的是：
</p>
<ul class="org-ul">
<li>找不到结构</li>
<li>无法只看局部</li>
<li>很难移动大块内容</li>
<li>任务、笔记、链接、代码彼此割裂</li>
</ul>


<p>
Org 对此的解决方法是：把文档看成层级结构，也就是 outline。官方文档将 Org 描述为 outliner；通过 folding(折叠)，可以只看当前分支，或看整棵子树。TAB对应的 <code>org-cycle</code> 就是这种设计的核心接口。
</p>

<p>
所以，Org 最开始就是一种“组织内容”的方法，之后才产生了 <code>TODO</code> 、 <code>Agenda</code> 、 表格、代码块这些能力。
</p>

<hr />
</div>
</div>
<div id="outline-container-orgbd22973" class="outline-3">
<h3 id="orgbd22973"><span class="section-number-3">1.3.</span> Org 的设计原理: 纯文本 + 层次结构 + 结构操作</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org62a670d" class="outline-4">
<h4 id="org62a670d"><span class="section-number-4">1.3.1.</span> 纯文本</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Org 文件本质上是普通文本文件，用任何编辑器都能打开，不依赖私有数据库，也不依赖专门的二进制格式。官方手册把这一点放得很前面：它是 plain-text system。
</p>

<p>
这意味着几个很重好的结果：
</p>
<ul class="org-ul">
<li>文件可长期保存，不容易被工具绑定</li>
<li>适合 Git 管理</li>
<li>可以和 shell、grep、脚本、版本控制一起工作</li>
<li>即便离开 Emacs，内容也依然存在</li>
</ul>


<p>
但“纯文本”不等于“没有结构”，Org 的关键是：它用一套非常轻量的标记，把纯文本组织成层级化对象。
</p>
</div>
</div>
<div id="outline-container-org10740ed" class="outline-4">
<h4 id="org10740ed"><span class="section-number-4">1.3.2.</span> 层级结构</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Org 的基础单位不是“段落”，而是 headline，也就是标题节点。官方手册里在 Document Structure 里先讲 Headlines，再讲 Visibility Cycling、Motion、Structure Editing，这个顺序本身就在说明：标题节点是整个系统的根。
</p>

<p>
例如：
</p>

<p>
#+BEGIN<sub>EXAMPLE</sub>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6bef478" class="outline-2">
<h2 id="org6bef478"><span class="section-number-2">2.</span> 项目</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org651e46c" class="outline-3">
<h3 id="org651e46c"><span class="section-number-3">2.1.</span> 子任务A</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgd8d8a85" class="outline-4">
<h4 id="orgd8d8a85"><span class="section-number-4">2.1.1.</span> 细节1</h4>
</div>
</div>
<div id="outline-container-org74fb6bd" class="outline-3">
<h3 id="org74fb6bd"><span class="section-number-3">2.2.</span> 子任务B</h3>
<div class="outline-text-3" id="text-2-2">
<p>
#+END<sub>EXAMPLE</sub>
</p>

<p>
这里不是单纯的缩紧文本，而是一棵树：
</p>

<ul class="org-ul">
<li><code>* 项目</code> 是父节点</li>
<li><code>** 子任务A</code> 和 <code>** 子任务B</code> 是它的子节点</li>
<li><code>***细节1</code> 是更深一层的后代节点</li>
</ul>


<p>
以后在学习TODO、属性、时间戳、链接时，本质上都是“把信息附着在某个节点上”。
</p>
</div>
<div id="outline-container-org5006b9f" class="outline-4">
<h4 id="org5006b9f"><span class="section-number-4">2.2.1.</span> 结构操作</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
普通编辑器大多以“字符”和“行”为主单位；Org 则更进一步提供“对子树操作”的命令。这里叫做 Structure Editing。
</p>

<p>
这件事情非常关键。比如移动一个一级标题时，移动的不是标题那一行，而是它下面的整棵子树。当提升或降低层次时，也不是改几个星号那么简单，而是在修改节点在整棵树中的位置。
</p>

<p>
所以，Org 的真实思维方式是：我不是在编辑一堆文本行，而是在编辑一棵树。
</p>

<hr />
</div>
</div>
</div>
<div id="outline-container-org8fc207c" class="outline-3">
<h3 id="org8fc207c"><span class="section-number-3">2.3.</span> Org 在 Emacs 里如何工作的</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org2f2656b" class="outline-4">
<h4 id="org2f2656b"><span class="section-number-4">2.3.1.</span> Org 建立在 Outline Mode 上</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
这是理解 Org 底层时最重要的一点。文档里明确说，Org 模式是基于Outline mode之上的。也就是说，Org 并不是凭空发明了一套折叠系统，它集成并扩展了 Emacs 原本处理层级文件的能力。
</p>

<p>
可以粗略理解为：
</p>
<ul class="org-ul">
<li>Emacs buffer 负责提供承载文本</li>
<li>Outline 提供“标题/层级/折叠”这类基础能力</li>
<li>Org 在其基础之上增加任务、时间、链接、表格、代码块等语义</li>
</ul>


<p>
因此，Org 不是网页式编辑器的“所见即所得”，而更像是一段面向结构的文本系统。
</p>
</div>
</div>
<div id="outline-container-orgf2b4af1" class="outline-4">
<h4 id="orgf2b4af1"><span class="section-number-4">2.3.2.</span> 折叠是核心交互</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
outline 的总览能力来自 folding，也就是隐藏大段文本，只留下整体结构和当前正在处理的部分。Org 用 <code>org-cycle</code> 把显示/隐藏压缩成一个核心命令，并绑定到TAB。
</p>

<p>
这里说明两件事情：
</p>
<ul class="org-ul">
<li>折叠不是附加功能，它就是与 Org 发生交互的主要方式之一。</li>
<li>Org 鼓励随时在“总览”和“局部细节”之间切换。</li>
</ul>


<p>
这也是为什么长文档在 Org 里依然好处理，因为不需要一直面对全部内容。
</p>
</div>
</div>
<div id="outline-container-org95409b1" class="outline-4">
<h4 id="org95409b1"><span class="section-number-4">2.3.3.</span> buffer里的“文本”与“结构”是同时存在的</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
在 Emacs 里，Org 文件当然还是一个普通 buffer，但 Org mode 会持续识别哪些行是标题、哪些区域属于某个节点、哪些内容是属性抽屉、哪些是列表、哪些是代码块。Org 不只是认标题，它会把buffer中不同模式的文本识别为不同结构元素。
</p>

<p>
可以理解为：
</p>
<ul class="org-ul">
<li>从文件层面看，它是纯文本。</li>
<li>从mode层面看，它是被解析过的结构化文本。</li>
</ul>


<p>
这也是为什么它后面能够导出、能生成Agenda、能执行Babel。因为在 Org 看来，这些不是一坨普通字符，而是有层次和语义的内容。
</p>

<hr />
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-04-08 三 03:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
